Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
ChexNet (Model)              (None, 1024)              7037504   
_________________________________________________________________
drop_0 (Dropout)             (None, 1024)              0         
_________________________________________________________________
dense_0 (Dense)              (None, 512)               524800    
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 512)               0         
_________________________________________________________________
drop_1 (Dropout)             (None, 512)               0         
_________________________________________________________________
out (Dense)                  (None, 1)                 513       
=================================================================
Total params: 7,562,817
Trainable params: 7,479,169
Non-trainable params: 83,648
_________________________________________________________________
